In [5]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Load the Titanic dataset
url = "https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv"
titanic_df = pd.read_csv(r'C:\Users\vsahi\OneDrive\Desktop\gender_submission.csv')

# Display the first few rows of the dataset
titanic_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [7]:

# Check for missing values
titanic_df.isnull().sum()

PassengerId    0
Survived       0
dtype: int64

In [ ]:
# For instance, to impute missing ages, you can use the median age:
median_age = titanic_df['Age'].median()
titanic_df['Age'].fillna(median_age, inplace=True)
     

# Now, let's drop the "Cabin" column as it has too many missing values:
titanic_df.drop('Cabin', axis=1, inplace=True)
     

# Lastly, drop rows with missing values in the "Embarked" column:
titanic_df.dropna(subset=['Embarked'], inplace=True)

In [15]:

# Basic statistics of numerical column
titanic_df.describe()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000